tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "michaeleisel/zld"
brew "zstd"
brew "m4"
brew "autoconf"
brew "automake"
brew "bash"
brew "ccache"
brew "cmake"
brew "cmake-docs"
brew "coreutils"
brew "e2fsprogs"
brew "exercism"
brew "libtool"
brew "ffmpeg"
brew "flyctl"
brew "gcc"
brew "genext2fs"
brew "gh"
brew "gifsicle"
brew "git-lfs"
brew "helix"
brew "imagemagick"
brew "jq"
brew "mas"
brew "neofetch"
brew "ninja"
brew "node"
brew "nvm"
brew "postgresql@14"
brew "python@3.10"
brew "python@3.9"
brew "qemu"
brew "roapi"
brew "rsync"
brew "ruff"
brew "tmux"
brew "tree"
brew "youtube-dl"
brew "zig"
brew "michaeleisel/zld/zld"
cask "macfuse"
