tap "homebrew/bundle"
tap "heroku/brew"
tap "oven-sh/bun"

brew "ag"
brew "aider"
brew "asdf"
brew "autoconf"
brew "automake"
brew "awscli"
brew "bash"
brew "bun"
brew "ccache"
brew "cmake"
brew "cmake-docs"
brew "coreutils"
brew "curl"
brew "direnv"
brew "exercism"
brew "libtool"
brew "llm"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gawk"
brew "git"
brew "gcc"
brew "gh"
brew "gifsicle"
brew "git-lfs"
brew "gpg"
brew "gnupg"
brew "gnu-sed"
brew "gnu-tar"
brew "gource"
brew "graphviz"
brew "heroku"
brew "htop"
brew "imagemagick"
brew "jq"
brew "ledger"
brew "make"
brew "mas"
brew "mutt"
brew "moreutils"
brew "neofetch"
brew "neovim"
brew "newman"
brew "node"
brew "nvm"
brew "ocrmypdf"
brew "ollama"
brew "openapi-generator"
brew "openssl"
brew "pandoc"
brew "pgrep"
brew "poppler"
brew "portaudio"
brew "postgresql@14"
brew "python@3.10"
brew "qemu"
brew "rbenv"
brew "redis"
brew "rga"
brew "ripgrep"
brew "roapi"
brew "rsync"
brew "ruby"
brew "ruby-build"
brew "ruff"
brew "shellcheck"
brew "shfmt"
brew "sqlite3"
brew "tig"
brew "tldr"
brew "tmux"
brew "tree"
brew "uv"
brew "watch"
brew "wget"
brew "whisper-cpp"
brew "yarn"
brew "yq"
brew "youtube-dl"
brew "yt-dlp"
brew "zig"
brew "zsh"
brew "zstd"

cask "anki"
cask "arc"
cask "arduino-ide"
cask "balenaetcher"
cask "chatgpt"
cask "claude"
cask "cursor"
cask "gimp"
cask "slack"
cask "cursor"
cask "backblaze"
cask "ghostty"
cask 'rectangle'
cask "firefox"
cask "framer"
cask "granola"
cask "elgato-control-center"
cask "handbrake"
cask "zoom"
cask "tuple"
cask "spotify"
cask "superwhisper"
cask "notion"
cask "notion-calendar"
cask "linear-linear"
cask "loom"
cask "macwhisper"
cask "vlc"
cask "visual-studio-code"
cask "netnewswire"
cask "screen-studio"
cask "microsoft-office"
cask "microsoft-teams"
cask "obsidian"
cask "openemu"
cask "orbstack"
cask "piezo"
cask "postman"
cask "proxyman"
cask "discord"
cask "handbrake"
cask "raspberry-pi-imager"
cask "figma"
cask "scratch"
cask "sonos"
cask "steam"
cask "superhuman"
cask "telegram"
cask "ticktick"
cask "todoist"
cask "vnc-viewer"
cask "zed"
# terminal emulators
cask "kitty"
cask "iterm2"
cask "warp"
# fonts
tap 'homebrew/cask-fonts'
cask 'font-hack'
cask 'font-jetbrains-mono'
cask 'font-inconsolata'
cask 'font-roboto'
cask 'font-roboto-mono'
cask 'font-ibm-plex'

mas 'Dark Noise: Ambient Sounds', id: 1465439395
mas 'Drafts', id: 1435957248
mas 'Xcode', id: 497799835
mas 'Tailscale', id: 1475387142
mas 'Kindle', id: 405399194
mas 'Logic Pro', id: 634148309
